/** @type {import('tailwindcss').Config} */
export default {
  content: [
    "./src/layouts/**/*.{astro,html,js,jsx}",
    "./src/components/Button/**/*.{astro,html,js,jsx}",
  ],
  theme: {
    extend: {
      screens: {
        328: "328px", // власний розмір
        343: "343px", // власний розмір
        382: "382px", // власний розмір
        704: "704px", // власний розмір
        736: "736px", // власний розмір
        960: "960px", // власний розмір
        1216: "1216px", // власний розмір
        1376: "1376px", // власний розмір
        1536: "1536px", // власний розмір
        1680: "1680px", // власний розмір
      },
      container: {
        center: true,
        // Якщо хочете встановити максимальні ширини для кожного екрану
        screens: {
          328: "328px",
          343: "343px",
          382: "382px",
          704: "704px",
          736: "736px",
          960: "960px",
          1216: "1216px",
          1376: "1376px",
          1536: "1536px",
          1680: "1680px",
        },
      },
      colors: {
        coal: "#171A1F",
        biscuit: "#F3F3EF",
        green: {
          100: "#033D21",
          200: "#034425",
          300: "#02301A",
          500: "#022213",
        },
        greenLight: { 200: "#CCD9D3" },
      },
    },
  },
  plugins: [],
};
